In [1]:
import pandas as pd
df=pd.read_csv("exams.csv")
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group A,high school,standard,completed,NaN,NaN,NaN
1,female,group D,some high school,free/reduced,none,NaN,NaN,NaN
2,male,group E,some college,free/reduced,none,NaN,NaN,NaN
3,male,group B,high school,standard,none,NaN,78.0,68.0
4,male,group E,associate's degree,standard,completed,NaN,73.0,68.0
...,...,...,...,...,...,...,...,...
995,male,group C,high school,standard,none,73.0,70.0,65.0
996,male,group D,associate's degree,free/reduced,completed,NaN,NaN,92.0
997,female,group C,some high school,free/reduced,none,NaN,NaN,NaN
998,female,group C,some college,standard,none,NaN,NaN,NaN
999,male,group A,some college,standard,completed,NaN,NaN,NaN

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   991 non-null    float64
 6   reading score                993 non-null    float64
 7   writing score                994 non-null    float64
dtypes: float64(3), object(5)
memory usage: 43.0+ KB

In [3]:
df.describe()

       math score  reading score  writing score
count  991.000000     993.000000     994.000000
mean    66.417760      69.039275      67.791751
std     15.388473      14.723167      15.601208
min     13.000000      27.000000      23.000000
25%     56.000000      60.000000      58.000000
50%     66.000000      70.000000      68.000000
75%     77.000000      79.000000      79.000000
max    100.000000     100.000000     100.000000

In [4]:
mean_value=df["math score"].mean()
print("mean:",mean_value)

mean: 66.41775983854693

In [6]:
median_value=df["math score"].median()
print("median:",median_value)

median: 66.0

In [7]:
mode_value=df["math score"].mode()[0]
print("mode:",mode_value)

mode: 63.0

In [8]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group A,high school,standard,completed,NaN,NaN,NaN
1,female,group D,some high school,free/reduced,none,NaN,NaN,NaN
2,male,group E,some college,free/reduced,none,NaN,NaN,NaN
3,male,group B,high school,standard,none,NaN,78.0,68.0
4,male,group E,associate's degree,standard,completed,NaN,73.0,68.0

In [9]:
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,male,group C,high school,standard,none,73.0,70.0,65.0
996,male,group D,associate's degree,free/reduced,completed,NaN,NaN,92.0
997,female,group C,some high school,free/reduced,none,NaN,NaN,NaN
998,female,group C,some college,standard,none,NaN,NaN,NaN
999,male,group A,some college,standard,completed,NaN,NaN,NaN

In [10]:
df.isnull()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,False,False,False,False,False,True,True,True
1,False,False,False,False,False,True,True,True
2,False,False,False,False,False,True,True,True
3,False,False,False,False,False,True,False,False
4,False,False,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False
996,False,False,False,False,False,True,True,False
997,False,False,False,False,False,True,True,True
998,False,False,False,False,False,True,True,True
999,False,False,False,False,False,True,True,True

In [11]:
df.isnull().head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,False,False,False,False,False,True,True,True
1,False,False,False,False,False,True,True,True
2,False,False,False,False,False,True,True,True
3,False,False,False,False,False,True,False,False
4,False,False,False,False,False,True,False,False

In [12]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     9
reading score                  7
writing score                  6
dtype: int64

In [14]:
df.isnull().head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,False,False,False,False,False,True,True,True
1,False,False,False,False,False,True,True,True
2,False,False,False,False,False,True,True,True
3,False,False,False,False,False,True,False,False
4,False,False,False,False,False,True,False,False

In [20]:
import numpy as n
df["reading score"].replace("",n.nan,inplace=True)

<ipython-input-20-815255d99ba3>:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["reading score"].replace("",n.nan,inplace=True)

In [16]:
df["reading score"]

0       NaN
1       NaN
2       NaN
3      78.0
4      73.0
       ...
995    70.0
996     NaN
997     NaN
998     NaN
999     NaN
Name: reading score, Length: 1000, dtype: float64

In [19]:
df["reading score"]=pd.to_numeric(df["reading score"],errors="coerce")

df["reading score"].fillna(df["reading score"].mean(),inplace=True)

<ipython-input-19-a68d4c3b8872>:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["reading score"].fillna(df["reading score"].mean(),inplace=True)

In [21]:
df["reading score"]

0      69.039275
1      69.039275
2      69.039275
3      78.000000
4      73.000000
         ...
995    70.000000
996    69.039275
997    69.039275
998    69.039275
999    69.039275
Name: reading score, Length: 1000, dtype: float64

In [22]:
df["reading score"].fillna(df["reading score"].median(),inplace=True)

In [23]:
df["reading score"]

0      69.039275
1      69.039275
2      69.039275
3      78.000000
4      73.000000
         ...
995    70.000000
996    69.039275
997    69.039275
998    69.039275
999    69.039275
Name: reading score, Length: 1000, dtype: float64

In [25]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df["-encoded"]=le.fit_transform(df["reading score"])
df["-encoded"],df["reading score"]

(0      41
 1      41
 2      41
 3      50
 4      45
        ..
 995    42
 996    41
 997    41
 998    41
 999    41
 Name: -encoded, Length: 1000, dtype: int32,
 0      69.039275
 1      69.039275
 2      69.039275
 3      78.000000
 4      73.000000
          ...
 995    70.000000
 996    69.039275
 997    69.039275
 998    69.039275
 999    69.039275
 Name: reading score, Length: 1000, dtype: float64)